app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_name", "body", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", ""], ["body", "hello"], ["movie_id", 3], ["created_at", "2015-12-02 18:10:49.790868"], ["updated_at", "2015-12-02 18:10:49.790868"]]
---
  def create

    @comment = Comment.new(comment_params)


    respond_to do |format|

      if @comment.save