app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(params[:sort])
---
SELECT "movies".* FROM "movies"  ORDER BY review

  def show
	@comments = @movie.comments.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = ?  [["movie_id", 4]]

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "review", "year", "genre", "synopsis", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "as"], ["review", 0], ["year", 0], ["genre", "d"], ["synopsis", "d"], ["created_at", "2015-11-11 19:36:05.291772"], ["updated_at", "2015-11-11 19:36:05.291772"]]

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "image" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image", "http://www.nitehawkcinema.com/wp-content/uploads/2014/06/The-Terminator-Poster.jpg"], ["updated_at", "2015-12-02 17:22:03.643502"], ["id", 3]]